Revit 2024 API
BuiltInFailures.SiteImportFailures.BoundaryDetectError Property
 A boundary on this surface could not be autodetected. Revit will impose one, but it may be larger than you want.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId BoundaryDetectError { get; }
Visual Basic
Public Shared ReadOnly Property BoundaryDetectError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ BoundaryDetectError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SiteImportFailures Class
Autodesk.Revit.DB Namespace